Add mermaid
